# 单行注释
print("hello world")  # print是打印函数，输出结果到控制台
#
# 多行注释
'''
注释1
注释1
注释1注释
'''

"""
注释1
注释1
注释1注释
"""

# 常量和变量

# 字面常量
1
2
3
4
5
5.5
5.6
'abc'
'abcdedf'
# python中数据基础结构
int
float
bool
str

# 转义序列
a = "what's your name"
b = 'what\'s your name'
b = 'what\'s your name'
b = 'what\'s your name'
b = "这是原始字符串\n换行符\t tab"

# 变量的命名规则
"""
1、以字母或者下划（_）unicode
2、区分大小写
3、避免变量命令同名

"""
print(r'这是原始字符串\n换行符\t tab')

print(b)

# 变量
a = 1
a = 'acbdde'
b = 'True'  # bool只有两种数据结构，为真为假（布尔值）
e = 9
#ctrl+alt+L 格式化代码的快捷键
#ctrl+/注释快捷键

c = "富家大室咖啡范德萨发大家撒开发富家大室咖啡范德萨发大家撒开发富家大室咖啡范德萨发大家撒开发富家大室咖啡范德萨" \
    "发大家撒开发富家大室咖啡范德萨发大家撒开发富家大室咖啡范德萨发大家撒开发富家大室咖啡范德萨发大家撒开发富家大" \
    "室咖啡范德萨发大家撒开发富家大室咖啡范德萨发大家撒开发富家大室咖啡范德萨发大家撒开发"
print(c)
